Ze-Hou/dap_link_prog/packs/GigaDevice/GD32H7xx_DFP/GigaDevice.GD32H7xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>GigaDevice</vendor>
  <url>https://gd32mcu.com</url>
  <name>GD32H7xx_DFP</name>
  <description>GigaDevice GD32H7xx Series Device Support and Examples</description>
  <releases>
    <release version="1.4.0" date="2025-02-18">
      Update the firmware library of Pack.
    </release>
      <release version="1.3.1" date="2024-11-29">
      Add new FLM.
    </release>
    <release version="1.3.0" date="2024-08-05">
      Add new GD32H767VM and GD32H767ZM series options.
    </release>
    <release version="1.2.3" date="2024-06-13">
      change OSPI FLM
    </release>
    <release version="1.2.2" date="2024-06-11">
      Add OSPI FLM
    </release>
    <release version="1.2.1" date="2024-06-11">
      Add GD32H767IMT6 and Update OSPI FLM
    </release>
    <release version="1.2.0" date="2024-01-23">
      Change the size of AXISRAM, Update the firmware library of Pack
    </release>
    <release version="1.1.0" date="2023-06-15">
      Update the firmware library of Pack, the information of feature and some descriptions.
    </release>
    <release version="1.0.1" date="2023-05-06">
      update GD32H7xx device family pack.add USBHS_HCHxSTCTL.
    </release>
    <release version="1.0.0" date="2023-04-06">
      First release version of GD32H7xx device family pack.
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>GigaDevice</keyword>
    <keyword>Device Support</keyword>
    <keyword>GD32H7xx</keyword>
  </keywords>
  <devices>
    <family Dfamily="GD32H7xx Series" Dvendor="GigaDevice:123">
      <processor Dcore="Cortex-M7"  DcoreVersion=" r1p2 " Dmpu="1" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <algorithm name="Flash/GD32H7xx_OSPI_Ext64MB_IO_solution1_0.FLM"   start="0x90000000" size="0x04000000" RAMstart="0x24000000" RAMsize="0xA0000" default="0" />
      <algorithm name="Flash/GD32H7xx_OSPI_Ext64MB_IO_solution2_0.FLM"   start="0x90000000" size="0x04000000" RAMstart="0x24000000" RAMsize="0xA0000" default="0" />
      <algorithm name="Flash/GD32H7xx_OSPI_Ext64MB_IO_solution1_1.FLM"   start="0x70000000" size="0x04000000" RAMstart="0x24000000" RAMsize="0xA0000"  default="0" />
      <algorithm name="Flash/GD32H7xx_OSPI_Ext64MB_IO_solution2_1.FLM"   start="0x70000000" size="0x04000000" RAMstart="0x24000000" RAMsize="0xA0000"  default="0" />
      <description>
GD32 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M7 core,which targeted at various MCU application areas.
GD32 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
GD32 family includes entry line, performance line and connectivity line currently.
      </description>
      <feature type="XTAL"               n="4000000"      m="50000000"                name="Crystal Oscillator"/>
      <feature type="CoreOther"          n="1"                                        name="CRC Calculation Unit"/>
      <feature type="DMA"                n="16"                                       name="General Purpose DMA with Centralized FIFO and Burst Support"/>
      <feature type="IntRC"              n="64000000"                                 name="Internal 64M RC oscillator"/>
      <feature type="IntRC"              n="48000000"                                 name="Internal 48M RC oscillator"/>
      <feature type="IntRC"              n="4000000"                                  name="Internal 4M RC oscillator"/>
      <feature type="RTC"                n="32000"                                    name="RTC with 32 kHz calibrated Oscillator and Battery Backup"/>
      <feature type="PLL"                n="3"                                        name="Internal PLL"/>
      <feature type="PowerMode"          n="4"                                        name="Run, Sleep, Deep-Sleep, Standby"/>
      <feature type="PowerOther"         n="4"                                        name="POR, PDR, LVD, and BPOR"/>
      <feature type="ExtInt"             n="25"                                       name="External interrupt"/>
      <feature type="Temp"               n="-40"          m="85"                      name="Extended Operating Temperature Range"/>
      <feature type="ADC"                n="2"            m="20"                      name="High-Performance ADC"/>
      <feature type="Timer"              n="4"            m="32"                      name="32-bit General Purpose Timer"/>
      <feature type="Timer"              n="12"           m="16"                      name="16-bit General Purpose Timer"/>
      <feature type="Timer"              n="2"            m="16"                      name="Advanced Timer"/>
      <feature type="Timer"              n="2"            m="64"                      name="Basic Timer"/>
      <feature type="Timer"              n="1"            m="24"                      name="SysTick Timer"/>
      <feature type="WDT"                n="2"                                        name="Watchdog timer"/>
      <feature type="MPSerial"           n="4"                                        name="Multi-Purpose Serial Interface Module: I2C, I2S, SPI, USART"/>
      <feature type="USART"              n="8"            m="37500000"                name="High-Speed USART Interface"/>
      <feature type="IOs"                n="134"                                      name="IO pins"/>
      <feature type="I2C"                n="4"                                        name="Low-Power I2C"/>
      <feature type="SPI"                n="6"                                        name="SPI Interface"/>
      <feature type="I2S"                n="4"                                        name="I2S Interface"  />
      <feature type="VCC"                n="1.8"          m="3.6"                     name="Voltage"/>
      <!-- ************************  Subfamily 'GD32H737'  **************************** -->
      <subFamily DsubFamily="GD32H737">
        <processor Dclock="600000000"/>
        <description>
          GD32H7xx - ARM Cortex-M7 Core
          Frequency up to 600 MHz
          Single-cycle multiplier and hardware divider

        Memories
          It provides up to 3840 KB embedded Flash memory 
          SRAM size up to 1024KB with HW parity checking
        </description>
        <!-- *************************  Device 'GD32H737VG'  ***************************** -->
        <device Dname="GD32H737VG">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXV"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x0100000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_1MB.FLM" start="0x08000000" size="0x0100000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
        <!-- *************************  Device 'GD32H737VI'  ***************************** -->
        <device Dname="GD32H737VI">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXV"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x0200000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_2MB.FLM" start="0x08000000" size="0x0200000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
        <!-- *************************  Device 'GD32H737VM'  ***************************** -->
        <device Dname="GD32H737VM">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXV"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x03C0000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_3840KB.FLM" start="0x08000000" size="0x03C0000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
        <!-- *************************  Device 'GD32H737ZG'  ***************************** -->
        <device Dname="GD32H737ZG">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXZ"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x0100000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_1MB.FLM" start="0x08000000" size="0x0100000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
