Ze-Hou/dap_link_prog/packs/GigaDevice/GD32H7xx_DFP/GigaDevice.GD32H7xx_DFP.pdsc
        <!-- *************************  Device 'GD32H737ZI'  ***************************** -->
        <device Dname="GD32H737ZI">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXZ"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x0200000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_2MB.FLM" start="0x08000000" size="0x0200000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
        <!-- *************************  Device 'GD32H737ZM'  ***************************** -->
        <device Dname="GD32H737ZM">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXZ"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x03C0000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_3840KB.FLM" start="0x08000000" size="0x03C0000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
        <!-- *************************  Device 'GD32H737IG'  ***************************** -->
        <device Dname="GD32H737IG">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXI"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x0100000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_1MB.FLM" start="0x08000000" size="0x0100000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
        <!-- *************************  Device 'GD32H737II'  ***************************** -->
        <device Dname="GD32H737II">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXI"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x0200000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_2MB.FLM" start="0x08000000" size="0x0200000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
        <!-- *************************  Device 'GD32H737IM'  ***************************** -->
        <device Dname="GD32H737IM">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXI"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x03C0000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_3840KB.FLM" start="0x08000000" size="0x03C0000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
      </subFamily>
      <!-- ************************  Subfamily 'GD32H757'  **************************** -->
      <subFamily DsubFamily="GD32H757">
        <processor Dclock="600000000"/>
        <description>
          GD32H7xx - ARM Cortex-M7 Core
          Frequency up to 600 MHz
          Single-cycle multiplier and hardware divider

        Memories
          It provides up to 3840 KB embedded Flash memory 
          SRAM size up to 1024KB with HW parity checking
        </description>
        <!-- *************************  Device 'GD32H757VG'  ***************************** -->
        <device Dname="GD32H757VG">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXV"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x0100000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_1MB.FLM" start="0x08000000" size="0x0100000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
        <!-- *************************  Device 'GD32H757VI'  ***************************** -->
        <device Dname="GD32H757VI">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXV"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x0200000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_2MB.FLM" start="0x08000000" size="0x0200000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
        <!-- *************************  Device 'GD32H757VM'  ***************************** -->
        <device Dname="GD32H757VM">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXV"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x03C0000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_3840KB.FLM" start="0x08000000" size="0x03C0000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
        <!-- *************************  Device 'GD32H757ZG'  ***************************** -->
        <device Dname="GD32H757ZG">
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXZ"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x0100000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_1MB.FLM" start="0x08000000" size="0x0100000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
