Ze-Hou/dap_link_prog/packs/GigaDevice/GD32H7xx_DFP/GigaDevice.GD32H7xx_DFP.pdsc
        <device Dname="GD32H767ZM">
          <processor Dclock="480000000"/>
          <compile header="Device\Include\gd32h7xx.h" define="USE_STDPERIPH_DRIVER GD32H7XX GD32H7XXZ"/>
          <memory    id="IROM1"            start="0x08000000"   size="0x03C0000"   startup="1"       default="1"/>
          <memory    name="AXISRAM"        access="rwx"         start="0x24000000" size="0x000D0000" default="1" init="0"/>
          <memory    name="ITCMRAM"        access="rwx"         start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="DTCMRAM"        access="rwx"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="SRAM0"          access="rwx"         start="0x30000000" size="0x00004000" default="1" init="0"/>
          <memory    name="SRAM1"          access="rwx"         start="0x30004000" size="0x00004000" default="1" init="0"/>
          <algorithm name="Flash/GD32H7xx_3840KB.FLM" start="0x08000000" size="0x03C0000" RAMstart="0x24000000" RAMsize="0x2000" default="1"/>
          <debug svd="SVD/GD32H7xx.svd"/>
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <!-- Device Conditions -->
    <condition id="GD32H7xx">
      <description>GigaDevice GD32H7xx Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32H7[356][79]?[GIM]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>
    <!-- Device + CMSIS Conditions -->
    <condition id="GD32H7xx CMSIS" >
      <description>GigaDevice GD32H7xx Devices and CMSIS-CORE</description>
      <accept condition="GD32H7xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GD32H7xx_libopt"/>
      <require Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="RCU"/>
      <require Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="PMU"/>
      <require Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="SYSCFG"/>
      <require Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="ENET"/>
    </condition>
    <!-- GD32H7xx STDPERIPHERALS RCU Conditions -->
    <condition id="GD32H7xx STDPERIPHERALS RCU">
      <description>GigaDevice GD32H7xx Standard Peripherals Drivers with RCU</description>
      <require condition="GD32H7xx CMSIS"/>
      <require Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="RCU"/>
    </condition>
    <!-- GD32H7xx STDPERIPHERALS MISC Conditions -->
    <condition id="GD32H7xx STDPERIPHERALS MISC">
      <description>GigaDevice GD32H7xx Standard Peripherals Drivers with MISC</description>
      <require condition="GD32H7xx CMSIS"/>
      <require Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="MISC"/>
    </condition>
    <!-- GD32H7xx STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32H7xx STDPERIPHERALS EVAL">
      <description>GigaDevice GD32H7xx Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32H7xx CMSIS"/>
      <require Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="USART"/>
    </condition>
  </conditions>
  <components>
    <!-- GD32H7xx_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
      <files>
        <!-- ADC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_adc.h"/>
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_adc.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <!-- GD32H7xx_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="CAN" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
      <files>
        <!-- CAN flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_can.h"/>
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_can.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <!-- GD32H7xx_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="CAU" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Cryptographic Acceleration Unit(CAU) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAU
        </RTE_Components_h>
      <files>
        <!-- CAU flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_cau.h"/>
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_cau.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="CMP" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Comparator (CMP) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CMP
        </RTE_Components_h>
      <files>
        <!-- CMP flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_cmp.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_cmp.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="CPDM" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Clock Phase Delay Module (CPDM) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CPDM
        </RTE_Components_h>
      <files>
        <!-- CPDM flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_cpdm.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_cpdm.c" attr="config" version="1.0.0" />
      </files>
    </component>
