Ze-Hou/dap_link_prog/packs/GigaDevice/GD32H7xx_DFP/GigaDevice.GD32H7xx_DFP.pdsc
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
      <files>
        <!-- CRC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_crc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_crc.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="CTC" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Clock trim controller (CTC) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CTC
        </RTE_Components_h>
      <files>
        <!-- CTC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_ctc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_ctc.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="DAC" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Digital to analog converter (DAC) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
      <files>
        <!-- DAC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_dac.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_dac.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
      <files>
        <!-- DBG flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_dbg.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_dbg.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="DCI" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Digital camera interface (DCI) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DCI
        </RTE_Components_h>
      <files>
        <!-- DCI flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_dci.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_dci.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
      <files>
        <!-- DMA flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_dma.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_dma.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="EDOUT" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Encoder Divided-Output controller (EDOUT) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EDOUT
        </RTE_Components_h>
      <files>
        <!-- EDOUT flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_edout.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_edout.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="EFUSE" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Electronic fuse (EFUSE) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EFUSE
        </RTE_Components_h>
      <files>
        <!-- EFUSE flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_efuse.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_efuse.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="ENET" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Ethernet(ENET) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ENET
        </RTE_Components_h>
      <files>
        <!-- ENET flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_enet.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_enet.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
      <files>
        <!-- EXTI flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_exti.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_exti.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="FAC" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Filter arithmetic accelerator (FAC) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FAC
        </RTE_Components_h>
      <files>
        <!-- FAC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_fac.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_fac.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="FMC" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
      <files>
        <!-- FMC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_fmc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_fmc.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="FWDGT" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
      <files>
        <!-- FWDGT flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_fwdgt.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_fwdgt.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
      <files>
        <!-- GPIO flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_gpio.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_gpio.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="HAU" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Digital camera interface (HAU) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_HAU
        </RTE_Components_h>
      <files>
        <!-- HAU flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_hau.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_hau.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="HPDF" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>High-Performance Digital Filter (HPDF) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_HPDF
        </RTE_Components_h>
      <files>
        <!-- HPDF flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_hpdf.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_hpdf.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="HWSEM" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Hardware semaphore (HWSEM) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_HWSEM
        </RTE_Components_h>
      <files>
        <!-- HWSEM flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_hwsem.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_hwsem.c" attr="config" version="1.0.0" />
      </files>
    </component>
