Ze-Hou/dap_link_prog/packs/GigaDevice/GD32H7xx_DFP/GigaDevice.GD32H7xx_DFP.pdsc
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
      <files>
        <!-- I2C flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_i2c.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_i2c.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="IPA" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Image processing accelerator (IPA) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_IPA
        </RTE_Components_h>
      <files>
        <!-- IPA flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_ipa.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_ipa.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="LPDTS" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Low power digital temperature sensor (LPDTS) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_LPDTS
        </RTE_Components_h>
      <files>
        <!-- LPDTS flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_lpdts.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_lpdts.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="MDIO" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Management data input / output (MDIO) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MDIO
        </RTE_Components_h>
      <files>
        <!-- MDIO flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_mdio.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_mdio.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="MDMA" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Master direct memory access controller (MDMA) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MDMA
        </RTE_Components_h>
      <files>
        <!-- MDMA flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_mdma.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_mdma.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="GD32H7xx CMSIS">
      <description>MISC driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
      <files>
        <!-- MISC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_misc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_misc.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="OSPI" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Octal-SPI interface (OSPI) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_OSPI
        </RTE_Components_h>
      <files>
        <!-- OSPI flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_ospi.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_ospi.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="OSPIM" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>OSPI I/O manager (OSPIM) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_OSPIM
        </RTE_Components_h>
      <files>
        <!-- OSPIM flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_ospim.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_ospim.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="PMU" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
      <files>
        <!-- PMU flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_pmu.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_pmu.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="RAMECCMU" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>RAM ECC monitor unit (RAMECCMU) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RAMECCMU
        </RTE_Components_h>
      <files>
        <!-- RAMECCMU flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_rameccmu.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_rameccmu.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="RCU" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
      <files>
        <!-- RCU flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_rcu.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_rcu.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="RSPDIF" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Receiver of Sony/Philips Digtial Interface (RSPDIF) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RSPDIF
        </RTE_Components_h>
      <files>
        <!-- RSPDIF flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_rspdif.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_rspdif.c" attr="config" version="1.0.0" />
      </files>
    </component>
