Ze-Hou/dap_link_prog/packs/GigaDevice/GD32H7xx_DFP/GigaDevice.GD32H7xx_DFP.pdsc
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="RTC" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
      <files>
        <!-- RTC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_rtc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_rtc.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="RTDEC" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Real-time decryption (RTDEC) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTDEC
        </RTE_Components_h>
      <files>
        <!-- RTDEC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_rtdec.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_rtdec.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="SAI" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Serial Audio Interface (SAI) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SAI
        </RTE_Components_h>
      <files>
        <!-- SAI flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_sai.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_sai.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="SDIO" Cversion="1.0.0" condition="GD32H7xx CMSIS">
      <description>Secure digital input/output interface (SDIO) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
      <files>
        <!-- SDIO flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_sdio.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_sdio.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="SPI_I2S" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
      <files>
        <!-- SPI flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_spi.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_spi.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="SYSCFG" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>System and memory architecture (SYSCFG) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SYSCFG
        </RTE_Components_h>
      <files>
        <!-- SYSCFG flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_syscfg.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_syscfg.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="TIMER" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>TIMER driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
      <files>
        <!-- TIMER flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_timer.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_timer.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="TLI" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>TFT-LCD interface (TLI) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TLI
        </RTE_Components_h>
      <files>
        <!-- TLI flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_tli.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_tli.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="TMU" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Trigonometric math unit (TMU) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TMU
        </RTE_Components_h>
      <files>
        <!-- TMU flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_tmu.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_tmu.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="TRIGSEL" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Trigger selection controller (TRIGSEL) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TRIGSEL
        </RTE_Components_h>
      <files>
        <!-- TRIGSEL flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_trigsel.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_trigsel.c" attr="config" version="1.0.0" />
      </files>
    </component>
