Ze-Hou/dap_link_prog/packs/GigaDevice/GD32H7xx_DFP/GigaDevice.GD32H7xx_DFP.pdsc
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="TRNG" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>True random number generator (TRNG) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TRNG
        </RTE_Components_h>
      <files>
        <!-- TRIGSEL flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_trng.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_trng.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="USART" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
      <files>
        <!-- USART flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_usart.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_usart.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="VREF" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>VREF (VREF) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_VREF
        </RTE_Components_h>
      <files>
        <!-- VREF flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_vref.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_vref.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="GD32H7xx_StdPeripherals" Csub="WWDGT" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32H7xx Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
      <files>
        <!-- WWDGT flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32h7xx_wwdgt.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32h7xx_wwdgt.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <!-- Utilities GD32H7xx -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32H7xx" Cversion="1.0.0" condition="GD32H7xx STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32h759i_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32h759i_eval.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Config GD32H7xx -->
    <component Cclass="Device" Cgroup="GD32H7xx_libopt" Cversion="1.0.0" condition="GD32H7xx CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Template/gd32h7xx_libopt.h"/>
      </files>
    </component>
    <!-- Startup GD32H7xx -->
    <component Cclass="Device" Cgroup="Startup"  Cversion="1.0.0" condition="GD32H7xx">
      <description>System Startup for GigaDevice GD32H7xx Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32h7xx.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32h7xx.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32h7xx.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>
</package>